; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	thermograph1 - mode
	infrared2 - mode
	thermograph0 - mode
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation2 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star5)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star4)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star5)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star0)
	(supports instrument12 thermograph1)
	(supports instrument12 thermograph0)
	(supports instrument12 infrared2)
	(calibration_target instrument12 Star3)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 GroundStation2)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
	(supports instrument14 thermograph1)
	(supports instrument14 thermograph0)
	(supports instrument14 infrared2)
	(calibration_target instrument14 Star1)
	(calibration_target instrument14 Star3)
	(supports instrument15 thermograph0)
	(supports instrument15 thermograph1)
	(supports instrument15 infrared2)
	(calibration_target instrument15 Star3)
	(calibration_target instrument15 Star5)
	(supports instrument16 infrared2)
	(calibration_target instrument16 GroundStation2)
	(calibration_target instrument16 Star5)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite3 Star10)
	(pointing satellite4 Star3)
	(pointing satellite6 Star10)
	(have_image Planet6 infrared2)
	(have_image Star7 infrared2)
	(have_image Phenomenon8 infrared2)
	(have_image Star9 thermograph0)
	(have_image Star10 infrared2)
))

)

; plan
1. (turn_to satellite6 star10 groundstation2)
   deleted: (pointing satellite6 groundstation2)
   added: (pointing satellite6 star10)
   goals met: 1 of 9
2. (turn_to satellite4 star3 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star3)
   goals met: 2 of 9
3. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 2 of 9
4. (calibrate satellite3 instrument7 star4)
   added: (calibrated instrument7)
   goals met: 2 of 9
5. (turn_to satellite3 planet6 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet6)
   goals met: 2 of 9
6. (take_image satellite3 planet6 instrument7 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 3 of 9
7. (turn_to satellite3 phenomenon8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon8)
   goals met: 3 of 9
8. (turn_to satellite0 phenomenon8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 9
9. (take_image satellite3 phenomenon8 instrument7 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 5 of 9
10. (turn_to satellite3 star7 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star7)
   goals met: 5 of 9
11. (take_image satellite3 star7 instrument7 infrared2)
   added: (have_image star7 infrared2)
   goals met: 6 of 9
12. (turn_to satellite3 star9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star9)
   goals met: 6 of 9
13. (take_image satellite3 star9 instrument7 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 7 of 9
14. (turn_to satellite3 star10 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star10)
   goals met: 8 of 9
15. (take_image satellite3 star10 instrument7 infrared2)
   added: (have_image star10 infrared2)
   goals met: 9 of 9
